Tests/Tests-TestCase1-StepOne-0-FAILED.txt

Status: FAILED
Time Taken: 9804
Size: 453
Timestamp: Mon Aug 28 11:51:19 MSK 2017
TestStep: StepOne

----------------- Messages ------------------------------
[ClientId] Missing token [131] in Response
[amount] Missing token [800] in Response

----------------- Properties ------------------------------
Endpoint: http://localhost:7800/CARD_TRANSFER
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Host : localhost:7800
Accept-Encoding : gzip,deflate
Content-Length : 757
Content-Type : application/soap+xml;charset=UTF-8;action="http://www.example.org/CARD_TRANSFER/POST_REQUEST"


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ib="http://ib.novy.com">
   <soap:Header/>
   <soap:Body>
      <ib:cardTransactRq>
         <ib:clientId>5</ib:clientId>
         <ib:phoneNum>79101785555</ib:phoneNum>
         <ib:amount>1000</ib:amount>
         <ib:sender>
            <ib:cardNo>1111222233337788</ib:cardNo>
            <ib:cardOwner>Ivan Petrov</ib:cardOwner>
            <ib:validThru>07.21</ib:validThru>
         </ib:sender>
         <ib:receiver>
            <ib:cardNo>1111222233334444</ib:cardNo>
            <ib:cardOwner>Vasiliy Sidorov</ib:cardOwner>
            <ib:validThru>12.22</ib:validThru>
         </ib:receiver>
      </ib:cardTransactRq>
   </soap:Body>
</soap:Envelope>

---------------- Response --------------------------
Response Headers: Server : Apache-Coyote/1.1
#status# : HTTP/1.1 200 OK
Content-Length : 453
Date : Mon, 28 Aug 2017 08:51:28 GMT
Content-Type : application/soap+xml;charset=utf-8


<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Body>
      <NS1:cardTransactRs xmlns:NS1="http://ib.novy.com">
         <NS1:guid>10787ab2-63c3-4cd8-a1fb-708c8a3e20d8</NS1:guid>
         <NS1:status>Your request is being processed</NS1:status>
         <NS1:clientId>5</NS1:clientId>
         <NS1:amount>1000</NS1:amount>
         <NS1:currentDayAmount>4000</NS1:currentDayAmount>
      </NS1:cardTransactRs>
   </soapenv:Body>
</soapenv:Envelope>
