Tests/Tests-TestCase_1-StepOne-0-FAILED.txt

Status: FAILED
Time Taken: 5701
Size: 455
Timestamp: Fri Aug 25 14:00:39 MSK 2017
TestStep: StepOne

----------------- Messages ------------------------------
[ClientId] Missing token [125] in Response

----------------- Properties ------------------------------
Endpoint: http://localhost:7800/CARD_TRANSFER
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Host : localhost:7800
Accept-Encoding : gzip,deflate
Content-Length : 759
Content-Type : application/soap+xml;charset=UTF-8;action="http://www.example.org/CARD_TRANSFER/POST_REQUEST"


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ib="http://ib.novy.com">
   <soap:Header/>
   <soap:Body>
      <ib:cardTransactRq>
         <ib:clientId>131</ib:clientId>
         <ib:phoneNum>79101789824</ib:phoneNum>
         <ib:amount>1000</ib:amount>
         <ib:sender>
            <ib:cardNo>2222333344445555</ib:cardNo>
            <ib:cardOwner>Ivan Petrov</ib:cardOwner>
            <ib:validThru>07.21</ib:validThru>
         </ib:sender>
         <ib:receiver>
            <ib:cardNo>1111222233334444</ib:cardNo>
            <ib:cardOwner>Vasiliy Sidorov</ib:cardOwner>
            <ib:validThru>12.22</ib:validThru>
         </ib:receiver>
      </ib:cardTransactRq>
   </soap:Body>
</soap:Envelope>

---------------- Response --------------------------
Response Headers: Server : Apache-Coyote/1.1
#status# : HTTP/1.1 200 OK
Content-Length : 455
Date : Fri, 25 Aug 2017 11:00:45 GMT
Content-Type : application/soap+xml;charset=utf-8


<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Body>
      <NS1:cardTransactRs xmlns:NS1="http://ib.novy.com">
         <NS1:guid>f99b8950-f3fc-472f-80e5-531fb6782049</NS1:guid>
         <NS1:status>Your request is being processed</NS1:status>
         <NS1:clientId>131</NS1:clientId>
         <NS1:amount>1000</NS1:amount>
         <NS1:currentDayAmount>1000</NS1:currentDayAmount>
      </NS1:cardTransactRs>
   </soapenv:Body>
</soapenv:Envelope>
